#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

[0m[1mrandom_id.lambda_functions_bucket_name: Refreshing state... [id=eAl5c8rne0I][0m
[0m[1maws_apigatewayv2_api.main: Refreshing state... [id=3rlm858roe][0m
[0m[1mmodule.lambda_health.aws_iam_role.lambda_execution_role: Refreshing state... [id=healthFunction-lambda-execution-role-prod][0m
[0m[1mmodule.lambda_register.aws_iam_role.lambda_execution_role: Refreshing state... [id=registerFunction-lambda-execution-role-prod][0m
[0m[1maws_iam_role.auth_execution_role: Refreshing state... [id=auth-lambda-execution-role-prod][0m
[0m[1mmodule.lambda_root.aws_iam_role.lambda_execution_role: Refreshing state... [id=rootFunction-lambda-execution-role-prod][0m
[0m[1maws_cloudwatch_log_group.lambda_log_group: Refreshing state... [id=/aws/lambda/prod/sre-bootcamp-api][0m
[0m[1mmodule.lambda_cidr_to_mask.aws_iam_role.lambda_execution_role: Refreshing state... [id=cidrToMaskFunction-lambda-execution-role-prod][0m
[0m[1mmodule.lambda_login.aws_iam_role.lambda_execution_role: Refreshing state... [id=loginFunction-lambda-execution-role-prod][0m
[0m[1mmodule.lambda_mask_to_cidr.aws_iam_role.lambda_execution_role: Refreshing state... [id=maskToCidrFunction-lambda-execution-role-prod][0m
[0m[1mmodule.s3_bucket_for_lambda.aws_s3_bucket.bucket: Refreshing state... [id=sre-bootcamp-functions-bucket78097973cae77b42-prod][0m
[0m[1mmodule.dynamodb_table_users.aws_dynamodb_table.dynamoTable: Refreshing state... [id=users-prod][0m
[0m[1maws_cloudwatch_log_group.main_api_gw: Refreshing state... [id=/aws/api-gw/sre-bootcamp-api-prod][0m
[0m[1mmodule.lambda_health.aws_iam_role_policy_attachment.lambda_execution_role_policies[0]: Refreshing state... [id=healthFunction-lambda-execution-role-prod-20230330231317103100000002][0m
[0m[1maws_iam_role_policy_attachment.lambda_auth_policies_attachment["arn:aws:iam::408257009451:policy/jwtSecret_Policy"]: Refreshing state... [id=auth-lambda-execution-role-prod-20230330231317110000000003][0m
[0m[1maws_iam_role_policy_attachment.lambda_auth_policies_attachment["arn:aws:iam::aws:policy/SecretsManagerReadWrite"]: Refreshing state... [id=auth-lambda-execution-role-prod-20230330231317194300000005][0m
[0m[1maws_iam_role_policy_attachment.lambda_auth_policies_attachment["arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"]: Refreshing state... [id=auth-lambda-execution-role-prod-20230330231317113200000004][0m
[0m[1mmodule.lambda_mask_to_cidr.aws_iam_role_policy_attachment.lambda_execution_role_policies[0]: Refreshing state... [id=maskToCidrFunction-lambda-execution-role-prod-20230330231317216000000006][0m
[0m[1mmodule.lambda_cidr_to_mask.aws_iam_role_policy_attachment.lambda_execution_role_policies[0]: Refreshing state... [id=cidrToMaskFunction-lambda-execution-role-prod-20230330231317096900000001][0m
[0m[1maws_apigatewayv2_stage.stage: Refreshing state... [id=prod][0m
[0m[1mmodule.lambda_root.aws_iam_role_policy_attachment.lambda_execution_role_policies[0]: Refreshing state... [id=rootFunction-lambda-execution-role-prod-20230330231317394100000007][0m
[0m[1maws_iam_policy.dynamoDbLambdaPolicy: Refreshing state... [id=arn:aws:iam::408257009451:policy/dynamoDbLambdaPolicy-prod][0m
[0m[1mmodule.lambda_register.aws_iam_role_policy_attachment.lambda_execution_role_policies[0]: Refreshing state... [id=registerFunction-lambda-execution-role-prod-2023033023132396470000000b][0m
[0m[1mmodule.lambda_register.aws_iam_role_policy_attachment.lambda_execution_role_policies[1]: Refreshing state... [id=registerFunction-lambda-execution-role-prod-2023033023132383640000000a][0m
[0m[1mmodule.lambda_login.aws_iam_role_policy_attachment.lambda_execution_role_policies[2]: Refreshing state... [id=loginFunction-lambda-execution-role-prod-2023033023132397250000000c][0m
[0m[1mmodule.lambda_login.aws_iam_role_policy_attachment.lambda_execution_role_policies[1]: Refreshing state... [id=loginFunction-lambda-execution-role-prod-2023033023132399720000000d][0m
[0m[1mmodule.lambda_login.aws_iam_role_policy_attachment.lambda_execution_role_policies[0]: Refreshing state... [id=loginFunction-lambda-execution-role-prod-20230330231323811000000008][0m
[0m[1mmodule.lambda_login.aws_iam_role_policy_attachment.lambda_execution_role_policies[3]: Refreshing state... [id=loginFunction-lambda-execution-role-prod-20230330231323814500000009][0m
[0m[1maws_s3_object.lambda_auth_code: Refreshing state... [id=authFunction-prod/app.zip][0m
[0m[1mmodule.lambda_root.aws_s3_object.lambda_code: Refreshing state... [id=rootFunction-prod/app.zip][0m
[0m[1mmodule.lambda_login.aws_s3_object.lambda_code: Refreshing state... [id=loginFunction-prod/app.zip][0m
[0m[1mmodule.lambda_mask_to_cidr.aws_s3_object.lambda_code: Refreshing state... [id=maskToCidrFunction-prod/app.zip][0m
[0m[1mmodule.s3_bucket_for_lambda.aws_s3_bucket_versioning.bucket_versioning: Refreshing state... [id=sre-bootcamp-functions-bucket78097973cae77b42-prod][0m
[0m[1mmodule.lambda_health.aws_s3_object.lambda_code: Refreshing state... [id=healthFunction-prod/app.zip][0m
[0m[1mmodule.lambda_cidr_to_mask.aws_s3_object.lambda_code: Refreshing state... [id=cidrToMaskFunction-prod/app.zip][0m
[0m[1mmodule.lambda_register.aws_s3_object.lambda_code: Refreshing state... [id=registerFunction-prod/app.zip][0m
[0m[1mmodule.s3_bucket_for_lambda.aws_s3_bucket_server_side_encryption_configuration.bucket_encryption: Refreshing state... [id=sre-bootcamp-functions-bucket78097973cae77b42-prod][0m
[0m[1mmodule.lambda_root.aws_lambda_function.function: Refreshing state... [id=rootFunction-prod][0m
[0m[1maws_lambda_function.lambda_authorizer_function: Refreshing state... [id=authFunction-prod][0m
[0m[1mmodule.lambda_login.aws_lambda_function.function: Refreshing state... [id=loginFunction-prod][0m
[0m[1mmodule.lambda_mask_to_cidr.aws_lambda_function.function: Refreshing state... [id=maskToCidrFunction-prod][0m
[0m[1mmodule.lambda_health.aws_lambda_function.function: Refreshing state... [id=healthFunction-prod][0m
[0m[1mmodule.lambda_register.aws_lambda_function.function: Refreshing state... [id=registerFunction-prod][0m
[0m[1mmodule.lambda_cidr_to_mask.aws_lambda_function.function: Refreshing state... [id=cidrToMaskFunction-prod][0m
[0m[1maws_apigatewayv2_authorizer.authorizer: Refreshing state... [id=afmmha][0m
[0m[1maws_lambda_permission.api_gateway_invoke: Refreshing state... [id=AllowExecutionFromAPIGateway][0m
[0m[1mmodule.lambda_cidr_to_mask.aws_lambda_permission.api_gw: Refreshing state... [id=AllowExecutionFromAPIGateway][0m
[0m[1mmodule.lambda_cidr_to_mask.aws_apigatewayv2_integration.lambda_integration: Refreshing state... [id=tqqw8yq][0m
[0m[1mmodule.lambda_health.aws_lambda_permission.api_gw: Refreshing state... [id=AllowExecutionFromAPIGateway][0m
[0m[1mmodule.lambda_health.aws_apigatewayv2_integration.lambda_integration: Refreshing state... [id=7st4jer][0m
[0m[1mmodule.lambda_mask_to_cidr.aws_apigatewayv2_integration.lambda_integration: Refreshing state... [id=4d1vif9][0m
[0m[1mmodule.lambda_mask_to_cidr.aws_lambda_permission.api_gw: Refreshing state... [id=AllowExecutionFromAPIGateway][0m
[0m[1mmodule.lambda_login.aws_lambda_permission.api_gw: Refreshing state... [id=AllowExecutionFromAPIGateway][0m
[0m[1mmodule.lambda_login.aws_apigatewayv2_integration.lambda_integration: Refreshing state... [id=3a34bge][0m
[0m[1mmodule.lambda_root.aws_lambda_permission.api_gw: Refreshing state... [id=AllowExecutionFromAPIGateway][0m
[0m[1mmodule.lambda_root.aws_apigatewayv2_integration.lambda_integration: Refreshing state... [id=2t6esal][0m
[0m[1mmodule.lambda_register.aws_lambda_permission.api_gw: Refreshing state... [id=AllowExecutionFromAPIGateway][0m
[0m[1mmodule.lambda_register.aws_apigatewayv2_integration.lambda_integration: Refreshing state... [id=81bz5qj][0m
[0m[1maws_apigatewayv2_deployment.deployment: Refreshing state... [id=1tyq5p][0m
[0m[1mmodule.lambda_health.aws_apigatewayv2_route.lambda_route: Refreshing state... [id=92gsdqe][0m
[0m[1mmodule.lambda_mask_to_cidr.aws_apigatewayv2_route.lambda_route: Refreshing state... [id=a6zazam][0m
[0m[1mmodule.lambda_cidr_to_mask.aws_apigatewayv2_route.lambda_route: Refreshing state... [id=afcr5d1][0m
[0m[1mmodule.lambda_login.aws_apigatewayv2_route.lambda_route: Refreshing state... [id=iv5gfg4][0m
[0m[1mmodule.lambda_register.aws_apigatewayv2_route.lambda_route: Refreshing state... [id=hjgx2mu][0m
[0m[1mmodule.lambda_root.aws_apigatewayv2_route.lambda_route: Refreshing state... [id=pi6sx9e][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [33m~[0m update in-place
[31m-[0m/[32m+[0m destroy and then create replacement
[0m
Terraform will perform the following actions:

[1m  # aws_apigatewayv2_deployment.deployment[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_apigatewayv2_deployment" "deployment" {
      [33m~[0m [0m[1m[0mauto_deployed[0m[0m = false [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mid[0m[0m            = "1tyq5p" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mtriggers[0m[0m      = {
          [31m-[0m [0m"redeployment" = "b370553cfd30fadee23ca9cd58af4e627284f8b0"
        } [33m->[0m [0m(known after apply) [31m# forces replacement[0m[0m
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[1m  # aws_lambda_function.lambda_authorizer_function[0m will be updated in-place[0m[0m
[0m  [33m~[0m[0m resource "aws_lambda_function" "lambda_authorizer_function" {
        [1m[0mid[0m[0m                             = "authFunction-prod"
      [33m~[0m [0m[1m[0mlast_modified[0m[0m                  = "2023-03-31T00:40:01.000+0000" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0msource_code_hash[0m[0m               = "ZB5urG5T+ykpCgYNQruJuH40r7ESTl7MpKW2rmpEurg=" [33m->[0m [0m"S588EGch8QQwRuOjQHpM4afSwW71PiqtHykn2HFRn0Y="
        [1m[0mtags[0m[0m                           = {}
        [90m# (21 unchanged attributes hidden)[0m[0m

        [90m# (2 unchanged blocks hidden)[0m[0m
    }

[1m  # aws_s3_object.lambda_auth_code[0m will be updated in-place[0m[0m
[0m  [33m~[0m[0m resource "aws_s3_object" "lambda_auth_code" {
      [33m~[0m [0m[1m[0metag[0m[0m                   = "16cadb17ed2000b18af3734623f40dda" [33m->[0m [0m"de33d57e4c4dd3b1baae59733bc07e24"
        [1m[0mid[0m[0m                     = "authFunction-prod/app.zip"
        [1m[0mtags[0m[0m                   = {}
      [33m~[0m [0m[1m[0mversion_id[0m[0m             = "p1wQ96aHHn6VmtfdeCy2EbRK6hzUvGZe" [33m->[0m [0m(known after apply)
        [90m# (11 unchanged attributes hidden)[0m[0m
    }

[1m  # module.lambda_cidr_to_mask.aws_lambda_function.function[0m will be updated in-place[0m[0m
[0m  [33m~[0m[0m resource "aws_lambda_function" "function" {
        [1m[0mid[0m[0m                             = "cidrToMaskFunction-prod"
      [33m~[0m [0m[1m[0mlast_modified[0m[0m                  = "2023-03-31T00:40:02.000+0000" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mqualified_arn[0m[0m                  = "arn:aws:lambda:us-east-2:408257009451:function:cidrToMaskFunction-prod:17" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mqualified_invoke_arn[0m[0m           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:408257009451:function:cidrToMaskFunction-prod:17/invocations" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0msource_code_hash[0m[0m               = "t1/bLyuiT6OjEHtKmn/soRAvRDRT0PIAhBjQ1i44iFw=" [33m->[0m [0m"xJR0fsQgbRxFBjl/9AomZn33TMcyhIi6fUdHMrVs68k="
        [1m[0mtags[0m[0m                           = {}
      [33m~[0m [0m[1m[0mversion[0m[0m                        = "17" [33m->[0m [0m(known after apply)
        [90m# (18 unchanged attributes hidden)[0m[0m

        [90m# (2 unchanged blocks hidden)[0m[0m
    }

[1m  # module.lambda_cidr_to_mask.aws_s3_object.lambda_code[0m will be updated in-place[0m[0m
[0m  [33m~[0m[0m resource "aws_s3_object" "lambda_code" {
      [33m~[0m [0m[1m[0metag[0m[0m                   = "e5890a7d7c7d46b120756c8a61a7bffb" [33m->[0m [0m"04fbfb0fb0ca2045f1a8b976d28ab3c9"
        [1m[0mid[0m[0m                     = "cidrToMaskFunction-prod/app.zip"
        [1m[0mtags[0m[0m                   = {}
      [33m~[0m [0m[1m[0mversion_id[0m[0m             = "vPnbftz30pdToP60LIIxyVCB1_Gjf7uS" [33m->[0m [0m(known after apply)
        [90m# (11 unchanged attributes hidden)[0m[0m
    }

[1m  # module.lambda_health.aws_lambda_function.function[0m will be updated in-place[0m[0m
[0m  [33m~[0m[0m resource "aws_lambda_function" "function" {
        [1m[0mid[0m[0m                             = "healthFunction-prod"
      [33m~[0m [0m[1m[0mlast_modified[0m[0m                  = "2023-03-31T00:40:01.000+0000" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mqualified_arn[0m[0m                  = "arn:aws:lambda:us-east-2:408257009451:function:healthFunction-prod:17" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mqualified_invoke_arn[0m[0m           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:408257009451:function:healthFunction-prod:17/invocations" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0msource_code_hash[0m[0m               = "88xzH11mkDsU4Ef3/awlsE35OY1VnLIRL8jWp346Ges=" [33m->[0m [0m"DLu8Sook5GElWfpnR5LpjaSEgQDv+iu519kQNBfNh7g="
        [1m[0mtags[0m[0m                           = {}
      [33m~[0m [0m[1m[0mversion[0m[0m                        = "17" [33m->[0m [0m(known after apply)
        [90m# (18 unchanged attributes hidden)[0m[0m

        [90m# (2 unchanged blocks hidden)[0m[0m
    }

[1m  # module.lambda_health.aws_s3_object.lambda_code[0m will be updated in-place[0m[0m
[0m  [33m~[0m[0m resource "aws_s3_object" "lambda_code" {
      [33m~[0m [0m[1m[0metag[0m[0m                   = "8b104d8c9ca1679c89055118a2d771fa" [33m->[0m [0m"7ccba5c2ea277ceb482d7d970d6a2fbd"
        [1m[0mid[0m[0m                     = "healthFunction-prod/app.zip"
        [1m[0mtags[0m[0m                   = {}
      [33m~[0m [0m[1m[0mversion_id[0m[0m             = "zvm89V5RwuboEepDS81O95ueHZ89AwAs" [33m->[0m [0m(known after apply)
        [90m# (11 unchanged attributes hidden)[0m[0m
    }

[1m  # module.lambda_login.aws_lambda_function.function[0m will be updated in-place[0m[0m
[0m  [33m~[0m[0m resource "aws_lambda_function" "function" {
        [1m[0mid[0m[0m                             = "loginFunction-prod"
      [33m~[0m [0m[1m[0mlast_modified[0m[0m                  = "2023-03-31T00:40:01.000+0000" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mqualified_arn[0m[0m                  = "arn:aws:lambda:us-east-2:408257009451:function:loginFunction-prod:17" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mqualified_invoke_arn[0m[0m           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:408257009451:function:loginFunction-prod:17/invocations" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0msource_code_hash[0m[0m               = "v/pbFMtvWDDb/aWdNupHr6SP6vE1LMknlkcHAJnon78=" [33m->[0m [0m"e62WAbnzj+NWzPu/+QBMoX3dAqmCAWU2F60E6OTuBhM="
        [1m[0mtags[0m[0m                           = {}
      [33m~[0m [0m[1m[0mversion[0m[0m                        = "17" [33m->[0m [0m(known after apply)
        [90m# (18 unchanged attributes hidden)[0m[0m

        [90m# (3 unchanged blocks hidden)[0m[0m
    }

[1m  # module.lambda_login.aws_s3_object.lambda_code[0m will be updated in-place[0m[0m
[0m  [33m~[0m[0m resource "aws_s3_object" "lambda_code" {
      [33m~[0m [0m[1m[0metag[0m[0m                   = "d2c078ceabb64a5c01a6cd11978f76a8" [33m->[0m [0m"bba6b3d13d482b1fc678e0cd10fe399f"
        [1m[0mid[0m[0m                     = "loginFunction-prod/app.zip"
        [1m[0mtags[0m[0m                   = {}
      [33m~[0m [0m[1m[0mversion_id[0m[0m             = "_MLB0uCxszGfub7luGiKUdziIRhyqB8G" [33m->[0m [0m(known after apply)
        [90m# (11 unchanged attributes hidden)[0m[0m
    }

[1m  # module.lambda_mask_to_cidr.aws_lambda_function.function[0m will be updated in-place[0m[0m
[0m  [33m~[0m[0m resource "aws_lambda_function" "function" {
        [1m[0mid[0m[0m                             = "maskToCidrFunction-prod"
      [33m~[0m [0m[1m[0mlast_modified[0m[0m                  = "2023-03-31T00:40:01.000+0000" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mqualified_arn[0m[0m                  = "arn:aws:lambda:us-east-2:408257009451:function:maskToCidrFunction-prod:17" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mqualified_invoke_arn[0m[0m           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:408257009451:function:maskToCidrFunction-prod:17/invocations" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0msource_code_hash[0m[0m               = "ghUejY5Cw53rVQ/watNsG0uOq+7UDUTEv0YJxmLVnz8=" [33m->[0m [0m"hiPgVZ3mdgz7GXptHKz+BRThUnVOuYrMZnngdJ4g7sM="
        [1m[0mtags[0m[0m                           = {}
      [33m~[0m [0m[1m[0mversion[0m[0m                        = "17" [33m->[0m [0m(known after apply)
        [90m# (18 unchanged attributes hidden)[0m[0m

        [90m# (2 unchanged blocks hidden)[0m[0m
    }

[1m  # module.lambda_mask_to_cidr.aws_s3_object.lambda_code[0m will be updated in-place[0m[0m
[0m  [33m~[0m[0m resource "aws_s3_object" "lambda_code" {
      [33m~[0m [0m[1m[0metag[0m[0m                   = "c100f5e5cf0291abd042af3ceef49da4" [33m->[0m [0m"a447ae0f526aedaa6548a7a8fc6cac1b"
        [1m[0mid[0m[0m                     = "maskToCidrFunction-prod/app.zip"
        [1m[0mtags[0m[0m                   = {}
      [33m~[0m [0m[1m[0mversion_id[0m[0m             = "zDx5YAX_6NQXLYJSR3bqPRBX.Sabnmd6" [33m->[0m [0m(known after apply)
        [90m# (11 unchanged attributes hidden)[0m[0m
    }

[1m  # module.lambda_register.aws_lambda_function.function[0m will be updated in-place[0m[0m
[0m  [33m~[0m[0m resource "aws_lambda_function" "function" {
        [1m[0mid[0m[0m                             = "registerFunction-prod"
      [33m~[0m [0m[1m[0mlast_modified[0m[0m                  = "2023-03-31T00:40:01.000+0000" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mqualified_arn[0m[0m                  = "arn:aws:lambda:us-east-2:408257009451:function:registerFunction-prod:17" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mqualified_invoke_arn[0m[0m           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:408257009451:function:registerFunction-prod:17/invocations" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0msource_code_hash[0m[0m               = "wTxqvbXYGF41b94qv866xIgk5if0NSNIch9vjdC4VHU=" [33m->[0m [0m"KbJUl39P7KJZG4itDz8RPWxK0jdy3R1/K/VW4QQvcEk="
        [1m[0mtags[0m[0m                           = {}
      [33m~[0m [0m[1m[0mversion[0m[0m                        = "17" [33m->[0m [0m(known after apply)
        [90m# (18 unchanged attributes hidden)[0m[0m

        [90m# (3 unchanged blocks hidden)[0m[0m
    }

[1m  # module.lambda_register.aws_s3_object.lambda_code[0m will be updated in-place[0m[0m
[0m  [33m~[0m[0m resource "aws_s3_object" "lambda_code" {
      [33m~[0m [0m[1m[0metag[0m[0m                   = "2774ac85c7971927be6585b3ac00e3f1" [33m->[0m [0m"fa8d19755e8efae94c29dc70cec4e281"
        [1m[0mid[0m[0m                     = "registerFunction-prod/app.zip"
        [1m[0mtags[0m[0m                   = {}
      [33m~[0m [0m[1m[0mversion_id[0m[0m             = "WAs2a7gcSNAHAbvCUuRYLsF2FqONCX9b" [33m->[0m [0m(known after apply)
        [90m# (11 unchanged attributes hidden)[0m[0m
    }

[1m  # module.lambda_root.aws_lambda_function.function[0m will be updated in-place[0m[0m
[0m  [33m~[0m[0m resource "aws_lambda_function" "function" {
        [1m[0mid[0m[0m                             = "rootFunction-prod"
      [33m~[0m [0m[1m[0mlast_modified[0m[0m                  = "2023-03-31T00:40:02.000+0000" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mqualified_arn[0m[0m                  = "arn:aws:lambda:us-east-2:408257009451:function:rootFunction-prod:17" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mqualified_invoke_arn[0m[0m           = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:408257009451:function:rootFunction-prod:17/invocations" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0msource_code_hash[0m[0m               = "JtQ4k8VtNcpoz0Zl+v4aPTL6EmdibOn9KvJjVi/IhHM=" [33m->[0m [0m"fcESMtYec/V6FvKcJR9gSbfGvWwzmQ/5h7C41f/7zAo="
        [1m[0mtags[0m[0m                           = {}
      [33m~[0m [0m[1m[0mversion[0m[0m                        = "17" [33m->[0m [0m(known after apply)
        [90m# (18 unchanged attributes hidden)[0m[0m

        [90m# (2 unchanged blocks hidden)[0m[0m
    }

[1m  # module.lambda_root.aws_s3_object.lambda_code[0m will be updated in-place[0m[0m
[0m  [33m~[0m[0m resource "aws_s3_object" "lambda_code" {
      [33m~[0m [0m[1m[0metag[0m[0m                   = "0b8e2b8ef2b9ff779508529a6dfa7939" [33m->[0m [0m"3b0b2dc58a1ae20e5de6e90fcaa9f2e3"
        [1m[0mid[0m[0m                     = "rootFunction-prod/app.zip"
        [1m[0mtags[0m[0m                   = {}
      [33m~[0m [0m[1m[0mversion_id[0m[0m             = "vIejgpc0FDCRbDZcHHnNfzFqz3vp38B6" [33m->[0m [0m(known after apply)
        [90m# (11 unchanged attributes hidden)[0m[0m
    }

[0m[1mPlan:[0m 1 to add, 14 to change, 1 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @trujillo9616, Action: `pull_request`*